# Markdown文本
matchmaker_title = "# 相亲判官"
intro_subtitle = "## 打包个人介绍\n在这里输入你的相亲介绍以及个人喜好，打包生成信息包。信息包加密规则请参考源代码，部署时请修改配置密钥以保证信息安全。"
workroom_subtitle = "## 判官工作间\n将两个信息包上传，并点击判断。请勿上传修改了文件名的文件，否则会导致文件无法解析。"
result_subtitle = ("## 判断结果\n在这里查看判断结果，无需担心信息泄露")

# 输入框的描述
input_title = "请输入个人信息介绍"
input_info = "请输入你的个人介绍，生活爱好，以及你对相亲对象的要求"
input_example = "个人介绍样例：大家好，我叫李昊，今年30岁，目前在一家互联网公司从事产品经理的工作。我性格比较外向，喜欢与人沟通，业余时间喜欢阅读、跑步和旅行。我认为生活应该是充实而有趣的，所以总是尽量找时间去体验不同的事物。对于相亲对象，我希望她善良、独立、有理想。长相不是最重要的，我更看重的是两个人在一起时的感觉，以及是否能够相互理解和支持。我期待的生活是两人可以共同成长，一起面对生活的挑战。"
download_description = "下载信息包"

# 上传文件的描述
upload_description1 = "第一个信息包"
upload_description2 = "第二个信息包"

# 结果的描述
result_title = "判断结果"
result_info = "结果为`是/否`，不会暴露其他信息或泄露用户隐私"

# 按钮的描述
button_text = "生成ZIP文件（生成后的文件由程序加密，可以放心分享给他人）"
judge_button_text = "判断是否合适（可能需要一定时间，请勿离开页面）"
